OpenNuvoton/M55M1BSP/Library/StdDriver/src/rtc.c
    u32Reg = RTC->TAMPCTL;

    u32Reg &= ~(RTC_TAMPCTL_DYNSRC_Msk | RTC_TAMPCTL_SEEDRLD_Msk | RTC_TAMPCTL_DYNRATE_Msk);

    u32Reg |= (u32ChangeRate) | ((u32SeedReload & 0x1UL) << RTC_TAMPCTL_SEEDRLD_Pos) |
              ((u32RefPattern) << RTC_TAMPCTL_DYNSRC_Pos);


    RTC->TAMPSEED = u32Seed; /* need set seed value before re-load seed */

    RTC->TAMPCTL = u32Reg;
}

/**
  * @brief      Set RTC Clock Source
  *
  * @param[in]  u32ClkSrc       u32ClkSrc is the RTC clock source. It could be
  *                             - \ref RTC_CLOCK_SOURCE_LXT
  *                             - \ref RTC_CLOCK_SOURCE_LIRC
  *                             - \ref RTC_CLOCK_SOURCE_LIRC32K
  *
  * @retval     RTC_CLOCK_SOURCE_LXT
  * @retval     RTC_CLOCK_SOURCE_LIRC
  * @retval     RTC_CLOCK_SOURCE_LIRC32K
  *
  * @details    This API is used to get the setting of RTC clock source.
  *             User must to enable the selected clock source by themselves executing perform this API.
  */
uint32_t RTC_SetClockSource(uint32_t u32ClkSrc)
{
    if (u32ClkSrc == RTC_CLOCK_SOURCE_LXT)
    {
        /* RTC clock source is external LXT */
        RTC->LXTCTL &= ~RTC_LXTCTL_RTCCKSEL_Msk;
        RTC->LXTCTL &= ~RTC_LXTCTL_C32KSEL_Msk;

        return RTC_CLOCK_SOURCE_LXT;
    }
    else if (u32ClkSrc == RTC_CLOCK_SOURCE_LIRC32K)
    {
        uint32_t u32TrimDefault;
        u32TrimDefault = inpw((uint32_t)SYS + 0xF94UL);
        /* Load LIRC32 trim setting */
        outpw(((uint32_t)RTC + 0x1F0UL), ((inpw((uint32_t)RTC + 0x1F0UL) & ~(0x1FFUL << 8)) | ((u32TrimDefault & 0x1FFUL) << 8)));
        /* RTC clock source is LIRC32K */
        RTC->LXTCTL |= RTC_LXTCTL_LIRC32KEN_Msk;
        RTC->LXTCTL &= ~RTC_LXTCTL_RTCCKSEL_Msk;
        RTC->LXTCTL |= RTC_LXTCTL_C32KSEL_Msk;

        return RTC_CLOCK_SOURCE_LIRC32K;
    }
    else if (u32ClkSrc == RTC_CLOCK_SOURCE_LIRC)
    {
        /* RTC clock source is LIRC */
        RTC->LXTCTL |= RTC_LXTCTL_RTCCKSEL_Msk;

        return RTC_CLOCK_SOURCE_LIRC;
    }
    else
    {
        /* Set the default RTC clock source is LIRC */
        RTC->LXTCTL |= RTC_LXTCTL_RTCCKSEL_Msk;

        return RTC_CLOCK_SOURCE_LIRC;
    }
}

/**
 * @brief       Set RTC GPIO Operation Mode
 *
 * @param[in]   u32PFPin        The single pin of GPIO-F port.
 *                              It could be 4~11, which means PF.4~PF.11.
 * @param[in]   u32Mode         Operation mode. It could be
 *                              - \ref RTC_IO_MODE_INPUT
 *                              - \ref RTC_IO_MODE_OUTPUT
 *                              - \ref RTC_IO_MODE_OPEN_DRAIN
 *                              - \ref RTC_IO_MODE_QUASI
 * @param[in]   u32DigitalCtl   The digital input path control of specified pin. It could be
 *                              - \ref RTC_IO_DIGITAL_ENABLE
 *                              - \ref RTC_IO_DIGITAL_DISABLE
 * @param[in]   u32PullCtl      The pull-up or pull-down control of specified pin. It could be
 *                              - \ref RTC_IO_PULL_UP_DOWN_DISABLE
 *                              - \ref RTC_IO_PULL_UP_ENABLE
 *                              - \ref RTC_IO_PULL_DOWN_ENABLE
 * @param[in]   u32OutputLevel  The I/O output level. 0: output low; 1: output high.
 *
 *
 * @details     This function is used to set specified GPIO operation mode controlled by RTC module.
 */
void RTC_SetGPIOMode(uint32_t u32PFPin, uint32_t u32Mode, uint32_t u32DigitalCtl, uint32_t u32PullCtl, uint32_t u32OutputLevel)
{
    uint32_t u32Offset;

    if ((u32PFPin == 4UL) || (u32PFPin == 5UL) || (u32PFPin == 6UL) || (u32PFPin == 7UL))
    {
        u32Offset = u32PFPin - 4UL;

        RTC_SET_IOCTL_BY_RTC(RTC);

        RTC->GPIOCTL0 = (RTC->GPIOCTL0 & ~(0x3FUL << (u32Offset * 8UL))) |
                        (u32Mode << (u32Offset * 8UL)) |
                        (u32OutputLevel << ((u32Offset * 8UL) + 2UL)) |
                        (u32DigitalCtl << ((u32Offset * 8UL) + 3UL)) |
                        (u32PullCtl << ((u32Offset * 8UL) + 4UL));
    }

    if ((u32PFPin == 8UL) || (u32PFPin == 9UL) || (u32PFPin == 10UL) || (u32PFPin == 11UL))
    {
        u32Offset = u32PFPin - 8UL;

        RTC_SET_IOCTL_BY_RTC(RTC);

        RTC->GPIOCTL1 = (RTC->GPIOCTL1 & ~(0x3FUL << (u32Offset * 8UL))) |
                        (u32Mode << (u32Offset * 8UL)) |
                        (u32OutputLevel << ((u32Offset * 8UL) + 2UL)) |
                        (u32DigitalCtl << ((u32Offset * 8UL) + 3UL)) |
                        (u32PullCtl << ((u32Offset * 8UL) + 4UL));
    }
}

/**
 * @brief       Set RTC GPIO Output Level
 *
 * @param[in]   u32PFPin        The single pin of GPIO-F port.
 *                              It could be 4~11, which means PF.4~PF.11.
 * @param[in]   u32OutputLevel  The I/O output level. 0: output low; 1: output high.
 *
 *
 * @details     This function is used to set GPIO output level by RTC module.
 */
void RTC_SetGPIOLevel(uint32_t u32PFPin, uint32_t u32OutputLevel)
{
    uint32_t u32Offset;

    if ((u32PFPin == 4UL) || (u32PFPin == 5UL) || (u32PFPin == 6UL) || (u32PFPin == 7UL))
    {
        u32Offset = u32PFPin - 4UL;

        RTC->GPIOCTL0 = (RTC->GPIOCTL0 & ~(0x4UL << (u32Offset * 8UL))) |
                        (u32OutputLevel << ((u32Offset * 8UL) + 2UL));
    }

    if ((u32PFPin == 8UL) || (u32PFPin == 9UL) || (u32PFPin == 10UL) || (u32PFPin == 11UL))
    {
        u32Offset = u32PFPin - 8UL;

        RTC->GPIOCTL1 = (RTC->GPIOCTL1 & ~(0x4UL << (u32Offset * 8UL))) |
                        (u32OutputLevel << ((u32Offset * 8UL) + 2UL));
    }
}

/**
 * @brief Enable clock frequency fail detector function.
 *
 * @param[in] u32FailBoundary       LXT Clock Frequency Detector Fail Boundary, valid values are between 0x1 ~ 0xFF.
 * @param[in] u32StopBoundary       LXT Clock Stop Frequency Detector Stop Boundary, valid values are between 0x1 ~ 0xFF.
 *
 * @details This API is used to enable the clock frequency detector.
 */
void RTC_EnableClockFrequencyDetector(uint32_t u32FailBoundary, uint32_t u32StopBoundary)
{
    uint32_t u32FailBoundary_tamp = u32FailBoundary;
    uint32_t u32StopBoundary_tamp = u32StopBoundary;

