OpenNuvoton/M55M1BSP/Library/StdDriver/src/rtc.c
    /* limit u32FailBoundary to 255, because FAILBD[23:16] register max vlaue is 0xFF*/
    if (u32FailBoundary_tamp > 255UL)
    {
        u32FailBoundary_tamp = 255UL;
    }

    /* limit u32StopBoundary to 255, because STOPBD[7:0] register max vlaue is 0xFF*/
    if (u32StopBoundary_tamp > 255UL)
    {
        u32StopBoundary_tamp = 255UL;
    }

    /* Set the LXT clock frequency monitor fail/stop boundary value.*/
    RTC->CDBR = ((u32FailBoundary_tamp) << RTC_CDBR_FAILBD_Pos) | ((u32StopBoundary_tamp) << RTC_CDBR_STOPBD_Pos);

    /* Set clock fail/stop detector function enabled */
    RTC->CLKDCTL = RTC_CLKDCTL_LXTFDEN_Msk;

    /* Set clock fail/stop detector switch LIRC32K enabled */
    RTC->CLKDCTL |= RTC_CLKDCTL_LXTFSW_Msk | RTC_CLKDCTL_LXTSTSW_Msk;

    /* Enable LIRC32K source */
    RTC->LXTCTL |= RTC_LXTCTL_LIRC32KEN_Msk;
}

/**
 * @brief Disable clock frequency fail detector function.
 *
 * @details This API is used to disable the clock frequency detector.
 */
void RTC_DisableClockFrequencyDetector(void)
{
    /* clear clock fail/stop detector function enabled */
    RTC->CLKDCTL &= ~(RTC_CLKDCTL_LXTFDEN_Msk);

    /* clear clock fail/stop detector switch LIRC32K enabled */
    RTC->CLKDCTL &= ~(RTC_CLKDCTL_LXTFSW_Msk | RTC_CLKDCTL_LXTSTSW_Msk);

    /* Set the LXT clock frequency monitor fail/stop boundary to default value.*/
    RTC->CDBR = ((0xF0UL) << RTC_CDBR_FAILBD_Pos) | ((0XF0UL) << RTC_CDBR_STOPBD_Pos);

    /* disable LIRC32K source */
    RTC->LXTCTL &= ~(RTC_LXTCTL_LIRC32KEN_Msk);
}


/** @} end of group RTC_EXPORTED_FUNCTIONS */
/** @} end of group RTC_Driver */
/** @} end of group Standard_Driver */
